#10 minutes sur Pandas
Ceci est un court introduction a Pandas, généré principalement par les nouveaux utilisateurs. Vous pouvez voir de meilleures recettes dans le Cookbook.
On importe la bibliothèque ainsi :

In [75]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#Création d'objet
Regardez la section sur l'introduction sur les structures de données.
Créons une Series en passant une liste de valeur, pandas crée par défaut un index d'entier :

In [11]:
s = pd.Series([1,3,5,np.nan,6,8])

In [12]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creer un DataFrame en passant une liste nump, avec un index datetime et les colonnes appelées :

In [17]:
dates = pd.date_range('20130101', periods=6)

In [14]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [19]:
df

                   A         B         C         D
2013-01-01  0.285779 -0.665764 -1.020185 -0.061819
2013-01-02 -2.061288 -0.342375 -0.251503  1.571908
2013-01-03 -1.498342  1.053722 -0.348173 -0.397369
2013-01-04 -0.047333 -0.183272  0.018567  1.674322
2013-01-05 -0.708325  1.151739 -0.742343 -0.833900
2013-01-06  1.567173 -0.826922 -0.426155 -0.402181

Creer un DataFrame en passant un dictionnaire d'objet qui peuvent être converti comme des séries.

In [20]:
 df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
   ....:

In [21]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Le tableau a des dtypes

In [22]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Si vous utilisez IPython, le remplissage de tableau (comme les attributs public) est automatiquement activé. Voici un subset d'attributs qui sera complété.

In [ ]:
df2.<TAB>
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.D

Comme vous pouvez le voir, la colonne A,B,C et D sont automatiquement complétées. E est aussi là; le reste des attributs sont tronqués pour la concision.

Visualiser la donnée

Voyez la section des bases.
Regardez le haut & le bas des lignes de la frame.

In [25]:
df.head()

                   A         B         C         D
2013-01-01  0.285779 -0.665764 -1.020185 -0.061819
2013-01-02 -2.061288 -0.342375 -0.251503  1.571908
2013-01-03 -1.498342  1.053722 -0.348173 -0.397369
2013-01-04 -0.047333 -0.183272  0.018567  1.674322
2013-01-05 -0.708325  1.151739 -0.742343 -0.833900

In [ ]:
df.tail(3)

Afficher l'index, les colonnes et les données numpy.

In [26]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [28]:
df.values

array([[ 0.2857789 , -0.66576409, -1.02018466, -0.06181904],
       [-2.06128807, -0.3423749 , -0.25150287,  1.57190788],
       [-1.49834157,  1.05372231, -0.34817341, -0.39736889],
       [-0.04733329, -0.1832724 ,  0.01856658,  1.67432225],
       [-0.70832453,  1.1517393 , -0.74234341, -0.83389973],
       [ 1.56717349, -0.8269225 , -0.42615523, -0.40218061]])

La fonction Describe montre un rapide résumé de vos données

In [29]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.410389  0.031188 -0.461632  0.258494
std    1.305763  0.861261  0.368689  1.085560
min   -2.061288 -0.826922 -1.020185 -0.833900
25%   -1.300837 -0.584917 -0.663296 -0.400978
50%   -0.377829 -0.262824 -0.387164 -0.229594
75%    0.202501  0.744474 -0.275671  1.163476
max    1.567173  1.151739  0.018567  1.674322

Transposer vos données

In [30]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.285779   -2.061288   -1.498342   -0.047333   -0.708325    1.567173
B   -0.665764   -0.342375    1.053722   -0.183272    1.151739   -0.826922
C   -1.020185   -0.251503   -0.348173    0.018567   -0.742343   -0.426155
D   -0.061819    1.571908   -0.397369    1.674322   -0.833900   -0.402181

Ordonner par un axe

In [31]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.061819 -1.020185 -0.665764  0.285779
2013-01-02  1.571908 -0.251503 -0.342375 -2.061288
2013-01-03 -0.397369 -0.348173  1.053722 -1.498342
2013-01-04  1.674322  0.018567 -0.183272 -0.047333
2013-01-05 -0.833900 -0.742343  1.151739 -0.708325
2013-01-06 -0.402181 -0.426155 -0.826922  1.567173

In [32]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  1.567173 -0.826922 -0.426155 -0.402181
2013-01-01  0.285779 -0.665764 -1.020185 -0.061819
2013-01-02 -2.061288 -0.342375 -0.251503  1.571908
2013-01-04 -0.047333 -0.183272  0.018567  1.674322
2013-01-03 -1.498342  1.053722 -0.348173 -0.397369
2013-01-05 -0.708325  1.151739 -0.742343 -0.833900

#Selection

Note : Tandis que les expressions de sellections et de configuration de Python / Numpy sont intuitifs et sont pratiques dans un travail interactif. Pour du code de production, nous recommandons les méthodes d'accès données de pandas, .at,.iat,.loc et .ix.
Voyez la documentation sur l'indexation et la selection de données et le multiindexage / Indexage avancé.

#Recueillir
Selectionner une colonne, qui porte une Series, equivaut à utiliser df.A

In [33]:
df['A']

2013-01-01    0.285779
2013-01-02   -2.061288
2013-01-03   -1.498342
2013-01-04   -0.047333
2013-01-05   -0.708325
2013-01-06    1.567173
Freq: D, Name: A, dtype: float64

Selectionner via [], qui découpe les lignes

In [34]:
df[0:3]

                   A         B         C         D
2013-01-01  0.285779 -0.665764 -1.020185 -0.061819
2013-01-02 -2.061288 -0.342375 -0.251503  1.571908
2013-01-03 -1.498342  1.053722 -0.348173 -0.397369

In [35]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -2.061288 -0.342375 -0.251503  1.571908
2013-01-03 -1.498342  1.053722 -0.348173 -0.397369
2013-01-04 -0.047333 -0.183272  0.018567  1.674322

#Sélecton par label
Voyez aussi dans Selection par label
Pour avoir une section croisée en utilisant label

In [36]:
df.loc[dates[0]]

A    0.285779
B   -0.665764
C   -1.020185
D   -0.061819
Name: 2013-01-01 00:00:00, dtype: float64

Selectionner sur plusieurs axes

In [37]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.285779 -0.665764
2013-01-02 -2.061288 -0.342375
2013-01-03 -1.498342  1.053722
2013-01-04 -0.047333 -0.183272
2013-01-05 -0.708325  1.151739
2013-01-06  1.567173 -0.826922

Montrer le decoupage de label, les deux points de fin sont indiques

In [38]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -2.061288 -0.342375
2013-01-03 -1.498342  1.053722
2013-01-04 -0.047333 -0.183272

Reduction dans les dimensions retourne un objet

In [39]:
df.loc['20130102',['A','B']]

A   -2.061288
B   -0.342375
Name: 2013-01-02 00:00:00, dtype: float64

Pour avoir une valeur scalaire

In [40]:
df.loc[dates[0],'A']

0.28577889896263792

Pour avoir un acces rapide à un scalaire (equivalent à avoir la valeur précédente).

In [41]:
df.at[dates[0],'A']

0.28577889896263792

#Selectionner par position
Voyez aussi la Selection par Position
Selection avec la position des entiers passes

In [42]:
df.iloc[3]

A   -0.047333
B   -0.183272
C    0.018567
D    1.674322
Name: 2013-01-04 00:00:00, dtype: float64

En decoupant par entier, cela se comporte pareillement qu'avec numpy et python

In [43]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.047333 -0.183272
2013-01-05 -0.708325  1.151739

Par la position des lists d'entiers, similaire a numpy/ python

In [44]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -2.061288 -0.251503
2013-01-03 -1.498342 -0.348173
2013-01-05 -0.708325 -0.742343

Pour découper les lignes explicitement

In [45]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -2.061288 -0.342375 -0.251503  1.571908
2013-01-03 -1.498342  1.053722 -0.348173 -0.397369

Pour découper les colonnes explicitement

In [46]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.665764 -1.020185
2013-01-02 -0.342375 -0.251503
2013-01-03  1.053722 -0.348173
2013-01-04 -0.183272  0.018567
2013-01-05  1.151739 -0.742343
2013-01-06 -0.826922 -0.426155

Pour obtenir une valeur explicitement

In [ ]:
df.iloc[1,1]

Pour obtenir une accession rapide a un scalaire (equivalent a la valeur precedente)

In [47]:
df.iat[1,1]

-0.34237489666584747

Indexation de boolean
En utilisant les valeurs d'une seule colonne pour selectionner les donnees

In [48]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.285779 -0.665764 -1.020185 -0.061819
2013-01-06  1.567173 -0.826922 -0.426155 -0.402181

Selectionner les valeurs de DataFrame ou les conditions sont rencontrees

In [49]:
df[df>0]

                   A         B         C         D
2013-01-01  0.285779       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN  1.571908
2013-01-03       NaN  1.053722       NaN       NaN
2013-01-04       NaN       NaN  0.018567  1.674322
2013-01-05       NaN  1.151739       NaN       NaN
2013-01-06  1.567173       NaN       NaN       NaN

En utilisant isin() pour filtrer

In [50]:
df2=df.copy()

In [51]:
df2['E'] =['one', 'one','two','three','four','three']

In [52]:
df2

                   A         B         C         D      E
2013-01-01  0.285779 -0.665764 -1.020185 -0.061819    one
2013-01-02 -2.061288 -0.342375 -0.251503  1.571908    one
2013-01-03 -1.498342  1.053722 -0.348173 -0.397369    two
2013-01-04 -0.047333 -0.183272  0.018567  1.674322  three
2013-01-05 -0.708325  1.151739 -0.742343 -0.833900   four
2013-01-06  1.567173 -0.826922 -0.426155 -0.402181  three

In [54]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.498342  1.053722 -0.348173 -0.397369   two
2013-01-05 -0.708325  1.151739 -0.742343 -0.833900  four

Configuration
Configuration une nouvelle colonne automatiquement pour aligner les donnees par index

In [57]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [58]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [59]:
df['F'] = s1

Configurer les valeurs par label

In [61]:
df.at[dates[0],'A']=0

Configurer les valeurs par position

In [62]:
df.iat[0,1]=0

Configurer en assignant une liste numpy

In [63]:
df.loc[:,'D'] = np.array([5] * len(df))

Le resultat de l'operation de configuration precedent

In [64]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.020185  5  NaN
2013-01-02 -2.061288 -0.342375 -0.251503  5  1.0
2013-01-03 -1.498342  1.053722 -0.348173  5  2.0
2013-01-04 -0.047333 -0.183272  0.018567  5  3.0
2013-01-05 -0.708325  1.151739 -0.742343  5  4.0
2013-01-06  1.567173 -0.826922 -0.426155  5  5.0

L'operation where avec configuration

In [65]:
df2=df.copy()

In [66]:
df2[df2>0]=-df2

In [67]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.020185 -5  NaN
2013-01-02 -2.061288 -0.342375 -0.251503 -5 -1.0
2013-01-03 -1.498342 -1.053722 -0.348173 -5 -2.0
2013-01-04 -0.047333 -0.183272 -0.018567 -5 -3.0
2013-01-05 -0.708325 -1.151739 -0.742343 -5 -4.0
2013-01-06 -1.567173 -0.826922 -0.426155 -5 -5.0

Données manquantes
Pandas utilise np.nan pour représenter les données manquantes. C'est par défaut non inclut dans les calculs. Voyez la section des données manquantes.
La réindexation vous permet de changer/ajouter/supprimer sur un axe spécifique. Cela retourne une copie des données.

In [68]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [69]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [70]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.020185  5  NaN  1.0
2013-01-02 -2.061288 -0.342375 -0.251503  5  1.0  1.0
2013-01-03 -1.498342  1.053722 -0.348173  5  2.0  NaN
2013-01-04 -0.047333 -0.183272  0.018567  5  3.0  NaN

Pour supprimer une ligne qui a des données manquantes

In [71]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -2.061288 -0.342375 -0.251503  5  1.0  1.0

Remplir les donnees manquantes

In [72]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.020185  5  5.0  1.0
2013-01-02 -2.061288 -0.342375 -0.251503  5  1.0  1.0
2013-01-03 -1.498342  1.053722 -0.348173  5  2.0  5.0
2013-01-04 -0.047333 -0.183272  0.018567  5  3.0  5.0

Pour avoir un masque booeleen ou les valeurs sont nan

In [78]:
pd.isna(df1)

AttributeError: module 'pandas' has no attribute 'isna'

Operations
Voyez la section des operations basiques

Stats
Les operations en general excluent les donnees manquantes
Faisons des statistiques descriptives

In [79]:
df.mean()

A   -0.458019
B    0.142149
C   -0.461632
D    5.000000
F    3.000000
dtype: float64

Meme operation sur d'autres axes

In [80]:
df.mean(1)

2013-01-01    0.994954
2013-01-02    0.668967
2013-01-03    1.241441
2013-01-04    1.557592
2013-01-05    1.740214
2013-01-06    2.062819
Freq: D, dtype: float64

Travailler sur des objets qui ont des dimensionalités différents et qui ont besoin d'alignement. En addition, pandas diffuse automatiquement parmi les dimensions spécifiques.

In [81]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [82]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [83]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.498342  0.053722 -1.348173  4.0  1.0
2013-01-04 -3.047333 -3.183272 -2.981433  2.0  0.0
2013-01-05 -5.708325 -3.848261 -5.742343  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

Apply
Appliquer des fonctions aux données

In [84]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.020185   5   NaN
2013-01-02 -2.061288 -0.342375 -1.271688  10   1.0
2013-01-03 -3.559630  0.711347 -1.619861  15   3.0
2013-01-04 -3.606963  0.528075 -1.601294  20   6.0
2013-01-05 -4.315287  1.679814 -2.343638  25  10.0
2013-01-06 -2.748114  0.852892 -2.769793  30  15.0

In [85]:
df.apply(lambda x:x.max() - x.min())

A    3.628462
B    1.978662
C    1.038751
D    0.000000
F    4.000000
dtype: float64

Histogrammes
Voir aussi faire des histogrammes et la discretisation

In [86]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [87]:
s

0    3
1    0
2    4
3    2
4    6
5    3
6    6
7    2
8    6
9    5
dtype: int32

In [88]:
s.value_counts()

6    3
3    2
2    2
5    1
4    1
0    1
dtype: int64

Les methodes de strings
Les series sont equipees avec un panel de methodes pour processer les strings dans l'attribut str ce qui le rend facile a operer sur chaque element de la liste, comme dans le code ci-dessous. Notez que le pattern matching dans str utilise generallement les expressions regulieres par defaut (et dans certains cas, on les utilise tt le temps). Voyez aussi la methode de vectorisation des strings.

In [89]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [91]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

Fusion
Concat
Pandas fournit des moyens pour faciliter la combinaison de Series, DataFrame et les objets Panel avec differents type de logique de configuration pour les indexes et la fonctionnalite de d'algebre relationnel dans le cas des operations join/merge 
Voyez aussi la section de merging.
Concatener les objets pandas avec concat()

In [92]:
df = pd.DataFrame(np.random.randn(10, 4))

In [93]:
df

          0         1         2         3
0  1.108015  0.639771  0.139997 -1.212201
1  0.366328  0.488836  1.445886  0.851993
2  0.602412  0.314937 -1.505296  0.331647
3  0.265314 -1.012838  0.025423 -0.498795
4  1.316920 -0.428864  1.482155 -1.749591
5  0.771548 -0.191203 -0.231243  0.066201
6  0.567987  0.750252  0.468139  0.959342
7 -1.837806 -1.716662  1.477184 -1.716741
8  0.424829  1.176324  0.711071 -0.281236
9 -1.270519  0.035775  2.271975 -0.191320

In [96]:
# briser en plusieurs morceaux
morceaux = [df[:3], df[3:7], df[7:]]

In [97]:
pd.concat(morceaux)

          0         1         2         3
0  1.108015  0.639771  0.139997 -1.212201
1  0.366328  0.488836  1.445886  0.851993
2  0.602412  0.314937 -1.505296  0.331647
3  0.265314 -1.012838  0.025423 -0.498795
4  1.316920 -0.428864  1.482155 -1.749591
5  0.771548 -0.191203 -0.231243  0.066201
6  0.567987  0.750252  0.468139  0.959342
7 -1.837806 -1.716662  1.477184 -1.716741
8  0.424829  1.176324  0.711071 -0.281236
9 -1.270519  0.035775  2.271975 -0.191320

Joindre
Merging facon SQL. Voir aussi la jointure facon base de donnees

In [98]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [99]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [100]:
left

   key  lval
0  foo     1
1  foo     2

In [101]:
right

   key  rval
0  foo     4
1  foo     5

In [102]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Un autre exemple peut etre donne ainsi :

In [103]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [104]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [105]:
left

   key  lval
0  foo     1
1  bar     2

In [106]:
right

   key  rval
0  foo     4
1  bar     5

In [107]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

Ajouter
Ajouter des lignes a un dataframe. Voir aussi l'ajout

In [108]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [109]:
df

          A         B         C         D
0 -1.519150 -0.204238 -0.588582 -0.794186
1 -0.447455  0.307729 -1.338225 -1.323824
2  0.236519  0.304757 -0.149162 -1.624901
3 -1.683090 -0.038592  1.736209 -0.850800
4 -2.027683  1.460522  0.233077  1.483218
5 -0.952933  0.421231  0.262732 -0.351927
6 -0.447445  0.346130 -1.213687  0.410950
7  2.177092 -1.224023 -0.666430  0.174764

In [110]:
s = df.iloc[3]

In [111]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -1.519150 -0.204238 -0.588582 -0.794186
1 -0.447455  0.307729 -1.338225 -1.323824
2  0.236519  0.304757 -0.149162 -1.624901
3 -1.683090 -0.038592  1.736209 -0.850800
4 -2.027683  1.460522  0.233077  1.483218
5 -0.952933  0.421231  0.262732 -0.351927
6 -0.447445  0.346130 -1.213687  0.410950
7  2.177092 -1.224023 -0.666430  0.174764
8 -1.683090 -0.038592  1.736209 -0.850800

Grouper
En utilisant "group by", on se refere a un process qui inclut un ou plus des etapes suivantes : 
-Separation des donnees en groupe base sur des criteres
-Appliquer une fonction a chaque groupe independemment
-Combiner les resultats en structures de donnees
Voir aussi la section sur le groupement

In [112]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
   ....:

In [113]:
df

     A      B         C         D
0  foo    one -0.568682 -0.124659
1  bar    one -0.700871  0.985598
2  foo    two -0.948861  1.642964
3  bar  three -0.587163  0.967975
4  foo    two -0.922207  0.838674
5  bar    two  1.841067  1.023759
6  foo    one  0.675420 -0.124596
7  foo  three -1.127803  1.650257

Grouper et appliquer une fonction sum au groupe resultant

In [114]:
df.groupby('A').sum()

            C         D
A
bar  0.553033  2.977333
foo -2.892133  3.882639

Groupe par plusieurs colonnes forme un index hierarchique, auquel on peut appliquer la fonction apply.

In [115]:
 df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.700871  0.985598
    three -0.587163  0.967975
    two    1.841067  1.023759
foo one    0.106738 -0.249256
    three -1.127803  1.650257
    two   -1.871069  2.481638